* Welcome at Scala User Group Düsseldorf:
#+BEGIN_SRC elisp
(play-sound-file-async "sounds/intro.mp3")
(sit-for 5.5)
(play-sound-file-async "sounds/intro2.mp3")
(shell-command-to-string "figlet -f slant -w 70 -c -k \"Applying FP Patterns\"")
#+END_SRC

#+RESULTS:
#+begin_example
     ___                   __        _                  ______ ____ 
    /   |   ____   ____   / /__  __ (_)____   ____ _   / ____// __ \
   / /| |  / __ \ / __ \ / // / / // // __ \ / __ `/  / /_   / /_/ /
  / ___ | / /_/ // /_/ // // /_/ // // / / // /_/ /  / __/  / ____/ 
 /_/  |_|/ .___// .___//_/ \__, //_//_/ /_/ \__, /  /_/    /_/      
        /_/    /_/        /____/           /____/                   
             ____          __   __                          
            / __ \ ____ _ / /_ / /_ ___   _____ ____   _____
           / /_/ // __ `// __// __// _ \ / ___// __ \ / ___/
          / ____// /_/ // /_ / /_ /  __// /   / / / /(__  ) 
         /_/     \__,_/ \__/ \__/ \___//_/   /_/ /_//____/  
                                                            
#+end_example


* Some technicality before we start

#+BEGIN_SRC scala
import scala.concurrent._
import scala.concurrent.duration._
import scala.concurrent.ExecutionContext.Implicits.global
import cats._, cats.kernel._, cats.data._, cats.implicits._, cats.syntax.all._
import scala.util.Try
#+END_SRC

#+RESULTS:
: import scala.concurrent._
: import scala.concurrent.duration._
: import scala.concurrent.ExecutionContext.Implicits.global
: import cats._
: import cats.kernel._
: import cats.data._
: import cats.implicits._
: import cats.syntax.all._
: import scala.util.Try


* Definition of Monoids

The Monoid type class:
#+BEGIN_SRC scala
trait Monoid[A] {
  def empty: A
  def combine(x: A, y: A): A
}

implicit class MonoidOps[A](val self: A) {
  // Normally |+| but that would clash
  def +|+(other: A)(implicit M: Monoid[A]) = 
    M.combine(self,other)
}
#+END_SRC

#+RESULTS:
: defined trait Monoid
: defined class MonoidOps


* Let's define some Monoids

1) Addition
2) Multiplication
3) List concatenation

#+BEGIN_SRC scala
implicit val intPlus: Monoid[Int] = new Monoid[Int] {
  override def empty: Int = 0
  override def combine(x: Int, y: Int): Int = x + y
}

1 +|+ 41
#+END_SRC

#+RESULTS:
: intPlus: Monoid[Int] = $anon$1@372ea7fa
: res20: Int = 42

#+BEGIN_SRC scala
implicit val doubleMul: Monoid[Double] = new Monoid[Double] {
  override def empty: Double = 1
  override def combine(x: Double, y: Double): Double = x * y
}

8.0 +|+ 5.25
#+END_SRC

#+RESULTS:
: doubleMul: Monoid[Double] = $anon$1@5232be9b
: res26: Double = 42.0

#+BEGIN_SRC scala
implicit def listConcat[A]: Monoid[List[A]] = new Monoid[List[A]] {
  override def empty: List[A] = List()
  override def combine(x: List[A], y: List[A]): List[A] = x ++ y
}

List(1,2,3) +|+ List(4,5,6)
#+END_SRC

#+RESULTS:
: listConcat: [A]=> Monoid[List[A]]
: res28: List[Int] = List(1, 2, 3, 4, 5, 6)


* Monoids can be combined

We can build monoids from monoids:

#+BEGIN_SRC scala
implicit def option[A:Monoid] = new Monoid[Option[A]] {
  def empty = None

  def combine(x: Option[A], y: Option[A]) = (x,y) match {
    case (Some(xx),Some(yy)) => Some(xx +|+ yy)
    case (Some(xx),None) => Some(xx)
    case (None,Some(yy)) => Some(yy)
    case (None,None) => None
  }
}
#+END_SRC

#+RESULTS:
: option: [A](implicit evidence$1: Monoid[A])Monoid[Option[A]]{def empty: None.type}

#+BEGIN_SRC scala
val none: Option[Int] = None
Option(2) +|+ Option(40)
Option(8.0) +|+ Option(5.25)
Option(List(1,2,3)) +|+ Option(List(0))
Option(1) +|+ none
none +|+ Option(42)
none +|+ none
#+END_SRC


* Monoids everywhere

#+BEGIN_SRC scala
1 |+| 2
Await.result(Future("a") |+| Future("b"), Duration.Inf)
Option("Hello, ") |+| Option("World")
Map(1->List('a','b')) |+| Map(1->List('c'),2->List())
#+END_SRC

#+RESULTS:
: res15: Int = 3
: res16: String = ab
: res17: Option[String] = Some(Hello, World)
: res18: Map[Int,List[Char]] = Map(1 -> List(a, b, c), 2 -> List())

Also:

  - ~Order[A]~
  - ~Either[A,B]~ if Monoid[B]
  - ~A => B~      if Monoid[B]
  - ~Map[A,B]~    if Monoid[B]
  - ~(A,B)~       if Monoid[A] and Monoid[B]

